      *> identification division
       IDENTIFICATION DIVISION.
      *> setup program id
       PROGRAM-ID. HELLO.
      *> setup procedure division
       PROCEDURE DIVISION.
      *> print a string
           DISPLAY 'WELCOME'.
      *> end the program
       STOP RUN.
