       IDENTIFICATION SECTION.
       PROGRAM-ID. LOOPS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CNT PIC 9(1) VALUE 0.
       01 WS-A PIC 9 VALUE 0.
       01 WS-Z PIC 9 VALUE 2.

       PROCEDURE SECTION.
      *> RUN THE B-PARA-TIMES PARAGRAPH
      *> 3 TIMES
           PERFORM B-PARA-TIMES 3 TIMES.

      *> RUN B-PARA-UNTIL THE CONST VARIABLE
      *> WS-CNT INCREMENTED INSIDE THE PARAGRAPH IS GREATER THAN 3
           PERFORM B-PARA-UNTIL WITH TEST AFTER UNTIL WS-CNT>3.

      *> YOU CAN ACTUALLY RUN FROM ONE PARAGRAPH
      *> TO ANOTHER ENDING PARAGRAPH
      *> THROUGH ALL PARAGRAPHS IN BETWEEN THE TWO
           PERFORM C-PARA-THRU THRU E-PARA-THRU.

      *> PERFORM A VARING STYLE LOOP WHICH SPECIFIED
      *> A VALUE TO INCREMENT UNTIL IT REACHES SOME FINAL
           PERFORM B-PARA-VARY VARYING WS-A FROM 1 BY 1 UNTIL WS-A=5.
           DISPLAY 'WS-A FILTER VARYING 'WS-A.
           STOP RUN.

      *> DEFINE PARAGRAPHS/FUNCTIONS THAT WILL
      *> BE CALLED IN OUR LOOPS ABOVE
       B-PARA-TIMES.
           DISPLAY 'IN B-PARA-TIMES'.

       B-PARA-UNTIL.
           DISPLAY 'WS-CNT: 'WS-CNT
           ADD 1 TO WS-CNT.

       C-PARA-THRU.
           DISPLAY 'IN C-PARA-THRU'.
       D-PARA-THRU.
           DISPLAY 'IN D-PARA-THRU'.
       E-PARA-THRU.
           DISPLAY 'IN E-PARA-THRU'.

       B-PARA-VARY.
           DISPLAY 'IN B-PARA ' WS-A.
